#Задача 1 
# Да се състави програма, чрез която се въвежда 4-цифренo естествено число от
#   интервала [1000.. 9999]. От това число се формират 2 нови 2-цифрени числа. Първото
#   число се формира от 1-та и 4-та цифра на въведеното число. Второто число се формира
#   от 2-рa - 3-та цифра на въведеното число. На екрана да се изведе дали 1-то ново число
#   e по-малко <, равно = или по-голямо от 2-то число.
#   Използвайте проверка на логическо условие - оператор if.
#   Пример: 3332 Изход: по-малко (32<33)
#   Пример: 1144 Изход: равни (14=14)
#   Пример: 9875 Изход: по-голямо (95>87)

#num = int(input("Enter a number:"))

#first = num//1000
#second = (num//100)%10
#third = ((num%1000)%100)//10
#forth = ((num%1000)%100)%10
#a = first*10 + forth
#b = second*10 + third

#if num>1000 and num<9999:
#    if a>b:
#        print("по-голямо","(",a,">",b,")")
#    elif a<b:
#        print("по-малко","(",a,"<",b,")")
#    else:
#        print("равни","(",a,"=",b,")")
#else:
#    print("error")

# Задача 2 
# Да се състави програма, чрез която се въвеждат 2 естествени двуцифрени
#числа a,b. Програмата да изведе съобщение дали последната цифра от произведението
#на двете числа е четна, както и самата цифра. Входни данни: a,b - естествени числа от
#интервала [10..99].
#Използвайте проверка на логическо условие - оператор if.
#Пример: 15, 25 Изход: 375, 5 нечетна

#a = int(input('Enter a number:'))
#b = int(input("Enter second number:"))
#x = a*b
#y = x%10
#formated_res = '{:d},{:d}' .format(x,y)

#if 10<=a<=99 and 10<=b<=99:
#    if y%2==0:
#        print(formated_res, "even")
#    else:
#        print(formated_res,"odd")
#else:
#    print('This number is not in the interval')


# Задача 3
#Трябва да се напълни цистерна с вода. Имате 2 кофи с вместимост 2 и 3 литра
#и ги ползвате едновременно. Да се състави програма, която по въведен обем извежда
#как ще прелеете течността с тези кофи, т.е. по-колко пъти ще се пълни всяка от кофите.
#Входни данни: естествено число от интервала [10..9999].
#Използвайте проверка на логическо условие - оператор if.
#Пример: 107 Изход: 21 пъти 2-те кофи, допълнително кофа от 2 литра

# Задача 4
# Съставете програма, която по въведено трицифренo число проверява дали
#числото се дели на всяка своя цифра. Във въведеното число да няма цифра 0.
#Използвайте проверка на логическо условие - оператор if.
#Пример: 121 Изход: 1:2:4 дели се

#num = int(input('Enter number:'))

#first = (num//10)//10
#second = (num//10)%10
#third = num%10
#all_num = first+second+third

#if first==0 or second==0 or third==0:
#    print('error')
#else:
#    print(first,second,all_num,'дели се',sep=':')

# Задача 5
# Да се състави програма, която да изчислява периметър и площ на
#правоъгълник по въведени дължини на прилежащи страни - естествени числа от
#интервала [5 ..100]. Изведете съобщение, ако страните формират квадрат.
#Използвайте проверка на логическо условие - оператор if.
#Пример: 4,4 Изход: квадрат лице 16, периметър 16

#a = int(input('Enter a:'))
#b = int(input('Enter b:'))

#P = 2*a+2*b
#S = a*b

#if 5<=a<=100 and 5<=b<=100:
#    if a!=b:
#        print('лице',S,',','периметър',P)
#    elif a==b:
#        print('квадрат' ',' 'лице',S,',','периметър',P)
#else:
#    print('The number is not in the interval 5...100')

# Задача 6
# Преди доста години имаше услуга - изпращане на луксозна телеграма.
#Поводи най-различни: рожден, имен ден, сватба и т.н. Цената се формираше по следния
#начин А: цена за бланка, B: цена за текст до 20 думи, C: цена за всяка дума, след първите
#20 думи. Стойностите на A, B, C са реални числа от интервала [0.02..0.89]. Да се състави
#програма, чрез която по въведени брой думи, стойности за A, B, брой думи, C се
#изчислява крайна цена на луксозна телеграма.
#Пример: A=0.2, B=0.5, 45 думи, C=0.05 Изход: 1.95

#A = 0.5
#a1 = A
#a = int(input('Enter quantity:'))
#a2 = a*A
#B = 0.2
#b = int(input('Enter quantity:'))
#b1 = B
#b2 = b*B
#C = b-20
#c = 0.5
#c1 = C*c
#words1 = b
#words2 = b+C
#if b<=20:
#    print('A=', a1 ,",",'B=',b1,',', words1,',','Изход:',A+B)
#elif b>20:
#    print('A=', a1 ,",",'B=',b1,',','C=', c1 ,',', words2,',','Изход:',A+B+C)

# Задача 7

# Задача8 
# Да се състави програма, която да отгатне колко е студено/топло по
#въведената температура в градус Целзий. Температурните интервали са: t <=-20 ледено
#студено; t <=0 && t>-20 студено; t <=15 && t>0 хладно; t <=25 && t>15 топло; t >25 горещо
#Входни данни: t - цяло число от интервала [-100..100].
#Пример: 12 Изход: хладно

#T = int(input('Enter temperature:'))
#t = T

#if t<=-20:
#    print('ледено студено')
#elif -20<=t<=0:
#    print('студено')
#elif 0<=t<=15:
#    print('хладно')
#elif 15<=t<=25:
#    print('топло')
#elif t>25:
#   print('горещо')

# Задача 9 
# Да се състави програма, която да провери дали е възможно един
#правоъгълник да се вмести изцяло в друг правоъгълник.
#Входни данни: X1, Y1, X2, Y2 - страните на 2-та правоъгълника - естествени числа от
#интервала [5 ..100].
#Пример: 5, 12; 18,7 Изход: вместват се

#X1 = int(input('Enter lenght x1:'))
#X2 = int(input('Enter lenght x2:'))
#Y1 = int(input('Enter lenght y1:'))
#Y2 = int(input('Enter lenght y2:'))

#Sx = X1*X2
#Sy = Y1*Y2

#if Sx<Sy:
#    print('Вместват се')